/* III::SBReadFile provides read access to SlideBook .sld files.
 *
 * Changelog:
 *
 */

/** \mainpage SBReadFile
 * 
 * \section Usage Usage
 * Allocate an instance with III_NewSBReadFile(). See III::SBReadFile for usage of
 * an instance. Deallocate an instance with III_DeleteSBReadFile().
 *
 * Failure during allocation, opening and usage of an III::SBReadFile instance
 * are governed by an exception propogation mask. Some failure cases also
 * have an extended error code that can be provided to III_GetErrorString()
 * for a more detailed description of the failure.
 *
 * III_SBReadFileVersion( III_Version* outVersion )
 *
 * \subsection Allocate 
 * III_NewSBReadFile( const char* inFilepath, UInt32 inExceptionMask)
 *
 * \copydoc III_NewSBReadFile()
 *
 * \subsection Deallocate 
 * III_DeleteSBReadFile(III::SBReadFile*)
 *
 * \copydoc III_DeleteSBReadFile()
 *
 * \subsection FailurePolicy 
 *
 * \size_t III_GetErrorString( char* ioErrorString, 
 *                             const UInt32 inRdState, 
 *                             const UInt32 inErrorCode);
 *
 * \copydoc III_GetErrorString()
 */

#pragma once

#include <cstddef>

// a copy of shared/Types.h without the Win/Mac cross types.
// http://nadeausoftware.com/articles/2012/01/c_c_tip_how_use_compiler_predefined_macros_detect_operating_system#UNIX
#if !defined(_WIN32) && (defined(__unix__) || defined(__unix) || (defined(__APPLE__) && defined(__MACH__)))
#ifndef __unix__
#define __unix__
#endif
#endif

// __has_feature compatability thunk
// For all versions of Microsoft VC the required features exist.
#ifndef __has_feature
  #define __has_feature(x) 0
#endif

// Prefixed to, hopefully, not pollute the client preprocessor's macro
// namespace.
#ifdef _WIN32
#define III_EXPORT __declspec(dllexport)
#endif

// Use GCC visibility pragma to export all symbols declared in this file.
// No need for a III_EXPORT definition
#ifdef __unix__
#pragma GCC visibility push(default)
#define III_EXPORT 
#endif

// III types exported to the client
#ifndef __III_BASIC_TYPES__
#define __III_BASIC_TYPES__

#ifdef _WIN32

typedef unsigned char	UInt8;   
typedef signed char		SInt8;   
typedef unsigned short	UInt16;  
typedef short			SInt16;  

typedef unsigned long	UInt32;  
typedef long			SInt32;  
typedef unsigned long long		UInt64;  
typedef long long		SInt64;  

#endif // _WIN32

#ifdef __unix__

#include <limits.h>
#include <stdint.h>

typedef uint8_t	    UInt8;
typedef int8_t		SInt8;
typedef uint16_t	UInt16;
typedef int16_t		SInt16;

typedef uint32_t	UInt32;  
typedef int32_t		SInt32;
typedef uint64_t	UInt64;
typedef int64_t		SInt64;

#endif // __unix__

#if __has_feature(cxx_static_assert) || (defined(_MSC_VER) && _MSC_VER >= 1600)
static_assert(sizeof(UInt8)  == 1, "UInt8 expected to have size 1.");
static_assert(sizeof(SInt8)  == 1, "SInt8 expected to have size 1.");
static_assert(sizeof(UInt16) == 2, "UInt16 expected to have size 2.");
static_assert(sizeof(SInt16) == 2, "SInt16 expected to have size 2.");
static_assert(sizeof(UInt32) == 4, "UInt32 expected to have size 4.");
static_assert(sizeof(SInt32) == 4, "SInt32 expected to have size 4.");
static_assert(sizeof(UInt64) == 8, "UInt64 expected to have size 8.");
static_assert(sizeof(SInt64) == 8, "SInt64 expected to have size 8.");
#else
#warning no static_assert detected for this compiler.
#endif // __III_NO_VERIFY_BASIC_TYPES__


typedef SInt32 PacketSizeType;

typedef SInt32 SampleIndex;	// sample index (eg. well of multiwell plate)
typedef SInt32 CaptureIndex; // set of contiguously captured fields 
typedef SInt32 PositionIndex; // stage location index
typedef SInt32 TimepointIndex; // time point index
typedef UInt16 PlaneIndex; // Z plane index
typedef SInt32 ChannelIndex;
typedef SInt32 MaskIndex;

typedef SInt32 RatioChannelIndex;

typedef SInt32 FRETChannelIndex;

typedef UInt16 adu_type;
typedef UInt16 mask_type;

typedef UInt16 ColorChannelIndex;

#endif // __III_BASIC_TYPES__

//! III namespace. Contains III::SBReadFile, constants and III::Exception.
namespace III {

struct SBReadFile;

class Exception;

/** const UInt32 III::kAllExceptionsMasked
 *
 * \brief The exception propogation mask value such that no exception propogates
